Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition Class
 The HierarchicDefinition class defines a hierarchy structure. This hierarchy structure can be instantiated and extended by hierarchical objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.HierarchicDefinition
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class HierarchicDefinition : ModelObject
<SerializableAttribute>
Public NotInheritable Class HierarchicDefinition
	Inherits ModelObject
The HierarchicDefinition type exposes the following members.
Constructors
Name | Description
HierarchicDefinition()
 Creates a new hierarchical definition instance.
HierarchicDefinition(Identifier)
 Instantiates a hierarchical definition with a known identifier. The instantiation has to be done before the hierarchical definition instance can be selected.
Top
Properties
Name | Description
CustomType
 The custom type of the hierarchical definition.
Drawable
 Defines whether the hierarchical definition is a drawable area in the model.
Father
 The father of the hierarchical definition.
HierarchicChildren
 An array list that contains the hierarchical definition's children.
HierarchyIdentifier
 The GUID of the hierarchical definition.
HierarchyType
 The type of the hierarchical definition.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 The name of the hierarchical definition.
Top
Methods
Name | Description
AddObjects
 Associates hierarchical objects with the hierarchical definition. Fails if the hierarchical definition doesn't exist in the model.
CompareTo
 Compares Identifiers of model objects.
 (Inherited from ModelObject.)
Delete
 Deletes the hierarchical definition instance from the model. The ID must be set.
 (Overrides ModelObject.Delete().)
Equals
 Check if Identifiers of model objects are same.
 (Inherited from ModelObject.)
GetAllReportProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
 (Inherited from ModelObject.)
GetAllUserProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
 (Inherited from ModelObject.)
GetChildren
 Returns an enumerator of all the children model objects.
 (Inherited from ModelObject.)
GetCoordinateSystem
 Returns the coordinate system for the given model object.
 (Inherited from ModelObject.)
GetCustomObjectType
 Gets custom object type name from an existing object.
 (Inherited from ModelObject.)
GetDoubleReportProperties
 Retrieves multiple double report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetDoubleUserProperties
 Retrieves all double properties for the model object.
 (Inherited from ModelObject.)
GetDynamicStringProperty
 Gets a dynamic string property from the model object.
 (Inherited from ModelObject.)
GetFatherComponent
 Returns the father component of the model object.
 (Inherited from ModelObject.)
GetHierarchicObjects
 Returns an enumerator of all the connected hierarchic objects.
 (Inherited from ModelObject.)
GetIntegerReportProperties
 Retrieves multiple integer report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetIntegerUserProperties
 Retrieves all integer properties for the model object.
 (Inherited from ModelObject.)
GetPhase
 Retrieves the phase of the model object (the phase number, the phase name, the phase comment and whether the phase is the current one or not).
 (Inherited from ModelObject.)
GetReportProperty(String, Double)
 Retrieves a double property of the report for the model object.
 (Inherited from ModelObject.)
GetReportProperty(String, Int32)
 Retrieves an integer property of the report for the model object.
 (Inherited from ModelObject.)
GetReportProperty(String, String)
 Retrieves a string property of the report for the model object.
 (Inherited from ModelObject.)
GetStringReportProperties
 Retrieves multiple string report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetStringUserProperties
 Retrieves all string properties for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, Double)
 Retrieves a double property for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, Int32)
 Retrieves an integer property for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, String)
 Retrieves a string property for the model object.
 (Inherited from ModelObject.)
Insert
 Inserts the hierarchical definition instance in the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the hierarchical definition instance in the model. The ID must be set.
 (Overrides ModelObject.Modify().)
RemoveObjects
 Removes associations to the given list of hierarchical objects. Fails if the hierarchical definition doesn't exist in the model.
Select
 Selects the hierarchical definition instance from the model. The ID must be set.
 (Overrides ModelObject.Select().)
SetCustomObjectType
 Sets a custom object type name for an existing object.
 (Inherited from ModelObject.)
SetDynamicStringProperty
 Sets a dynamic string property for the model object.
 (Inherited from ModelObject.)
SetLabel
 Sets a label for an object when a new instance is created, this method must be called before Insert. The label is used in plug-ins for identifying the changed object in modification.
 (Inherited from ModelObject.)
SetPhase
 Sets the phase of the model object.
 (Inherited from ModelObject.)
SetUserProperties
 Sets multiple properties for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, Double)
 Sets a double property for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, String)
 Sets a string property for the model object.
 (Inherited from ModelObject.)
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           HierarchicDefinition scenarioDefinition = new HierarchicDefinition();
           scenarioDefinition.Name = "Scenario type";
           scenarioDefinition.HierarchyType = HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_TASK_SCENARIO;
           scenarioDefinition.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace
Tekla.Structures.Model.HierarchicObject